<script>
import TheCheckbox from '../InputElement/TheCheckbox.vue';
export default {
  props: {
    currentActive: Number,
  },
  components: {
    TheCheckbox,
  },
  data() {
    return {
      rules1: [
        '會員：指於YouBike官方網站、服務中心、Kiosk(自動服務機)、APP等完成註冊程序者。',
        '租車：指會員於本公司有提供本服務之公共自行車站點，使用指定之電子票證/電子支付，租借公共自行車使用之謂。',
        '還車：指會員將公共自行車歸還於本公司有提供本服務之公共自行車站點，並使用指定之電子票證/電子支付完成扣款繳費之謂。',
        '單次使用者：指非屬會員而使用信用卡進行單次借還公共自行車之人。',
        'YouBike 1.0：指車身色系為橘色搭配黃色之YouBike公共自行車。',
        'YouBike 2.0：指車身色系為白色搭配黃色之YouBike公共自行車。',
        'YouBike 2.0E：指車身色系為白色搭配橘色之YouBike公共電力輔助自行車。'
      ],
      rules2: [
        {
          title: '個人資料蒐集的類別',
          contents: ['依「個人資料保護法」規定，會員為使用本服務提供本公司之個人資料類別包括：姓名、身分證字號、出生年月日、行動電話、電子郵件地址、信用卡號碼及電子票證號碼或電子支付帳號。']
        },
        {
          title: '個人資料蒐集的目的',
          contents: ['依「個人資料保護法之特定目的及個人資料之類別」，會員的個人資料將使用目的包括：(001)人身保險、(063)非公務機關依法定義務所進行個人資料之蒐集處理及利用、(069)契約、類似契約或其他法律關係事務、(090)消費者、客戶管理與服務、(135)資（通）訊服務、(136)資（通）訊與資料庫管理、(137)資通安全與管理、(157)調查、統計與研究分析、(181) 其他經營合於營業登記項目或組織章程所定之業務。']
        },
        {
          title: '個人資料利用之期間',
          contents: ['特定目的存續期間。', '依相關法令規定或本公司執行業務所必須訂之，並以期限較長者為準。']
        },
        {
          title: '個人資料利用之地區',
          contents: ['臺灣地區']
        },
        {
          title: '個人資料利用之對象及方式',
          contents: ['會員之個人資料，將依前項蒐集目的範圍內，供本公司、主管機關、關係企業及合作夥伴內部使用。', '本公司得按各縣市政府之政策及相關法規，以會員註冊之個人資料逕代會員投保公共自行車傷害保險。', '方式：以自動化機器或其他非自動化之利用方式。']
        },
        {
          title: '個人資料之查詢、閱覽及刪除',
          extra: '依個人資料保護法第三條規定，會員得向本公司：',
          contents: ['查詢或請求閱覽其個人資料。', '請求製給其個人資料之複製本。', ' 請求補充或更正其個人資料。', '請求停止蒐集、利用或處理其個人資料。', '請求刪除其個人資料。']
        },
        {
          title: '若不提供個人資料所致權益之影響',
          contents: ['您可自由選擇是否提供相關個人資料，惟若拒絕提供相關個人資料，將無法註冊為本公司之會員，並無法獲得相關服務。']
        },
      ],
      rules3: [
        {
          extra: '會員於完成本服務之註冊程序後，應負責維持電子票證及電子支付之機密安全，並同意以下事項：',
          contents: [
            '不得以竊盜、冒用等不當手法取得電子票證號碼或電子支付帳號。',
            ' 電子票證、電子支付或其電子錢包遭到盜用或發生其他任何安全問題時，將立即通知本公司。'
          ]
        }
      ],
      rules5:[
        {
          title: '經完成註冊而成為會員者，僅屬取得使用本服務之資格，本公司不保證會員可隨時租車與還車。如因此致生之任何損害，均與本公司無涉。會員於欲終止租借而無車位可供歸還時，YouBike 1.0系統提供滿站增時功能、YouBike 2.0使用者亦可透過APP辦理，會員可依此取得免費使用時間至鄰近站點還車或於該站等候。',
        },
        {
          title: '會員有效使用期限自註冊完成之日起，至本契約第七條規定之事由成就或本服務經主管機關命本公司終止提供服務之日止。',
        },
        {
          title: '本服務所提供之自行車，僅適於身高140公分至190公分間之人使用，超出或未達於此身高限制之人不得租車使用，如因此致生損害者，本公司不負任何賠償責任。',
        },
        {
          title: '會員不得以任何非法目的或方式使用本服務，應遵守中華民國相關法規及道路騎乘之慣例，在秉持尊重路權，相互禮讓之前提下騎乘，並依以下原則使用本服務：',
          contents: [
            '應確保自身安全騎乘之條件，會員於精神狀態及體能條件不足以安全順利騎乘時，應避免租借或停止租借。', 
            '遵守「道路交通管理處罰條例」第三章慢車、「道路交通安全規則」第五章慢車規定。', 
            '遵守道路交通標誌、標線、號誌之指示，並服從執行交通勤務警察之指揮。',
            '留意騎乘腳踏車時不應侵入快車道行駛，不得在禁止穿越地段穿越道路。', 
            '騎乘時，應保持環境警覺，注意路況並維持適當行車安全距離。', 
            '煞車操作先煞後輪減速後，再煞前輪，儘量避免緊急煞車，以保持騎乘舒適及安全。', 
            '雨天路面濕滑及下坡之情形下，放慢行車速度。', 
            '行駛時，不爭先、爭道、並行競駛或以其他危險方式駕駛。',
            '超車時，應在慢車道可容超越前車之處，使得沿車左邊超越，再駛入原行路線。',
            '會員不得利用本服務從事侵害他人權益或違法之行為，並配合公平使用租賃原則，不以投機方式連續或長期佔用，造成其他使用者的不便。',
            '本服務屬無人化管理，會員於租車前應依本公司官方網站、官方APP或租賃站點張貼之說明及指示，檢查自行車是否可正常使用，若有異常者，應避免租借；租借後五分鐘內發現自行車有故障或異常情事者，應立即於原租賃站還車或連絡客服人員尋求協助，本公司就該次租賃不予收費。'
          ]
        },
        {
          title: '會員於租借期間不慎將自行車遺失者，除有不能向警察機關報案之情形外，應盡速就近向警察機關完成報案程序，並將報案證明提供與本公司，及支付自租車起至遺失時間（依報案證明所載）之租借費用，租賃關係始即終止。因可歸責於會員或本契約第十條第（三）項所指第三人之事由，且該自行車自遺失日起逾三個月未尋回者，會員應按YouBike 1.0車款新臺幣9,000元、YouBike 2.0車款新臺幣15,000元之標準賠付本公司。如嗣後車輛尋回並歸還予本公司者，本公司將以會員已賠償之金額為限、扣除車輛必要之維護檢修費用後，無息返還會員剩餘金額。',
        },
        {
          title: '會員應以電子票證或電子支付方式支付租金。會員應持已註冊開卡之電子票證或電子支付帳號，至場站設備租借車輛。一張電子票證或電子支付帳號對一車，不得重複取車。',
        },
        {
          title: '單次使用者應以信用卡支付租金，依Kiosk指示進行YouBike 1.0之租車與還車程序，或依官方APP指示進行YouBike 2.0之租車與還車程序。',
        },
        {
          title: '本自行車僅限單人騎乘，不得搭載乘客、超載或改裝車輛，亦不得載送下列物品：',
          contents: [
            '違禁品。', 
            '危險品。', 
            '不潔或易污損自行車之物品。', 
            '不適宜隨車之動物。', 
            '影響騎乘安全之物品。']
        },
        {
          title: '非經本公司事前書面同意，會員不得將自行車使用於行銷、廣告、宣傳、影劇拍攝、產品展示等商業性或非商業性之用途。',
        },
        {
          title: '會員於租賃期間應負擔所租借車輛之一切交通違規罰鍰及處分，如經本公司代為繳納或履行者，會員應對本公司負損害賠償之責；如自行車遭拖吊者，其相關保管費、罰鍰、規費等，應由會員負擔。',
        },
        {
          title: '自行車發生擦撞或毀損致會員或第三人身體傷亡或財物損失時，除有不能向警察機關報案之情形外，會員應立即報案並通知本公司後，租賃關係即為終止。事故原因可歸責於會員時，會員應負擔法律及賠償責任。因可歸責於會員之事由致本自行車毀損者，會員應負賠償責任。',
        },
        {
          title: '使用本服務期間如發生交通事故時，應立即撥打110報警及通知本公司，並為拍照存證、移置車輛等必要處置，以免阻礙交通及再次發生事故。如有傷亡情事，請立即撥打119尋求協助。因該事故所生之救援費、修理費、自行車修理期間之租金，及造成第三人之一切損害，應由會員負擔之。',
        },
        {
          title: '會員使用本自行車應盡善良管理人注意義務保管之責，禁止出賣、質押、典當或自行修護等行為。遺失期間之自行車，由本公司進行協尋公示，其所有權仍歸本公司，經尋獲者亦同。',
        },
        {
          title: '會員如遺失隨車鎖之鑰匙，除應立即通知本公司外，並應賠償隨車鎖鑰匙之工本費新臺幣200元整。',
        },
        {
          title: '本公司就本服務已投保以下險種，其公共自行車責任險及公共自行車傷害保險配合機關政策提供。',
          contents: [
            '產品責任險：投保金額美金五百萬元整。', 
            '公共意外責任險：投保金額新臺幣二千四百萬元整。', 
            '公共自行車責任險：每人體傷或死亡最高理賠新臺幣二百萬元整。', 
            '公共自行車傷害險：每一事故失能死亡最高保險金新臺幣一百萬元整；住院傷害醫療保險金日額新臺幣一千元整。']
        },
      ],
      rules6: [
        '依會員所騎乘地區之各官方網站（https://www.youbike.com.tw/）公告為準。',
        'YouBike 1.0 與YouBike 2.0之跨縣市借還車政策，以官方網站（https://www.youbike.com.tw）公告為準。'
      ],
      rules7:[
        '本公司保留依法及按主管機關命令而變更服務內容之權利。',
        ' 會員需隨時確保個人資料之正確性及完整性，如有登錄不實、不完整或錯誤者，其所致生之損害或不利益（包括但不限於公共自行車傷害險所受之保障）除應由會員自行承擔外，本公司亦得暫停或終止會員使用本服務之全部或一部。',
        ' 會員如違反中華民國法律、本契約規定者，本公司得逕行終止或暫停會員使用本服務之權限；如因此致本公司受有損害者，會員應負擔損害賠償責任。',
        '本公司於接獲會員本人、代理人或受託人之通知、或經政府機關之命令、或依相關法規規定、或會員連續二年以上未使用本服務者，本公司得終止會員帳號權限，並得刪除帳號相關資料及交易紀錄。',
        '會員不得將會員資格轉讓予第三人。'
      ],
      rules9:[
        '本公司所使用之硬體、軟體或程式、網站及Kiosk上所有內容，包括但不限於著作、圖片、檔案、資訊、資料、網站架構、網站畫面的安排、網頁設計，均由本公司或其他權利人依法擁有其智慧財產權，包括但不限於商標權、專利權、著作權、營業秘密與專有技術等。任何人不得逕自使用、修改、重製、公開播送、改作、散布、發行、公開發表、進行還原工程、解編或反向組譯。',
        '會員欲引用或轉載前項所載內容，應依法取得本公司或其他權利人事前書面同意。如有違反，會員應依法負損害賠償責任。',
        '本公司及其關係企業為行銷宣傳本服務，就本服務相關之商品或服務名稱、圖樣、呈現等（以下稱「YouBike商標」），依其註冊或使用之狀態，受商標法及公平交易法等相關法律之保護，未經本公司事前書面同意，任何人不得基於營利目的使用「YouBike商標」。'
      ],
      rules10:[
        '會員於使用本服務時，即視為會員已閱讀、瞭解並同意接受本契約之全部內容。',
        ' 非屬完全行為能力人之會員，除應經法定代理人或監護人閱讀、瞭解並同意本服務條款之所有內容後，始得使用本服務外，亦有前項之適用。',
        ' 會員如將完成註冊之電子票證/電子支付帳號或本服務提供之自行車，借、讓予第三人使用者，除應擔保該第三人知悉、同意本契約之內容外，並應與該第三人就本契約所生之義務負連帶責任。',
        '依本契約所載之會員權利義務，除電子票證/電子支付之使用規範外，單次使用者均準用之。'
      ],
      rules12:[
        '本契約之解釋與適用，以及與本契約有關之爭議，悉依中華民國法律適用辦理，並以臺灣臺北地方法院為第一審管轄法院。',
        '本公司未行使或執行本契約任何權利或規定，不構成前開權利或規定之棄權。若任何本契約規定，經有管轄權之法院認定無效者，其餘部分仍應存續且有效。'
      ],
      rules13:[
        '出租人名稱：微笑單車股份有限公司',
        '負責人：楊劉麗珠',
        '聯絡地址：臺北市信義區基隆路二段51號17樓之2',
        'YouBike 1.0服務電話：新北/02-89785522',
        'YouBike 2.0服務電話：02-89788822',
        '公共自行車租賃系統YouBike服務使用注意事項，請參照各縣市YouBike官方網站說明。'
      ],
    }
  },
  methods: {
  },
  created() { }
}
</script>

<template>
  <div v-if="currentActive === 1" class="">
    <h5 class="text-center text-olive-green font-bold">閱讀會員條款</h5>
    <div class="w-full h-[250px] bg-gray-input rounded-lg text-xs px-4 py-8 mb-4 overflow-y-auto mobile:h-[300px]">
      <p>10811</p>
      <p>公共自行車租賃系統YouBike會員定型化契約</p>
      <p>服務內容</p>
      <p>YouBike是由微笑單車股份有限公司（以下簡稱「本公司」）經設站地點所在縣市機關授權，所提供之自動化甲地租借乙地還車之公共自行車租賃服務（以下簡稱「本服務」）。除會員所註冊之該縣市公共自行車租賃服務之外，會員亦可在本公司同意之其他地區相容系統使用本服務。</p>
      <div class="mt-4">
        <p class="font-semibold mb-2">第一條  名詞定義</p>
        <ul class="pl-6">
          <li v-for="(rule, index) in rules1" :key="`rule1-${index}`" class="list-decimal">{{ rule }}</li>
        </ul>
      </div>
      <div class="mt-4">
        <p class="font-semibold mb-2">第二條  個資規範</p>
        <ul class="pl-6">
          <li v-for="(rule2, index) in rules2" :key="`rule2-${index}`" class="list-decimal">
            {{ rule2.title }}
            <p>{{ rule2.extra }}</p>
            <!-- {{ rule2.content }} -->
            <ul class="pl-6">
              <li v-for="(rule, index) in rule2.contents" :key="`rule2-content-${index}`" class="list-disc">
                {{ rule }}
              </li>
            </ul>
          </li>
        </ul>
      </div>
      <div class="mt-4">
        <p class="font-semibold mb-2">第三條  電子票證及電子支付使用</p>
        <div v-for="(rule3, index) in rules3" :key="`rule3-${index}`">
          <p class="pl-2 mb-1">{{ rule3.extra }}</p>
          <ul class="pl-6">
            <li v-for="(rule, index) in rule3.contents" :key="`rule3-content-${index}`" class="list-decimal">{{ rule }}</li>
          </ul>
        </div>
      </div>
      <div class="mt-4">
        <p class="font-semibold mb-2">第四條  兒童及青少年等保護</p>
        <p class="pl-2">依民法規定屬無行為能力、限制行為能力或受輔助宣告之會員，應經法定代理人、輔助人閱讀、瞭解並同意本契約之所有內容後，方得使用本服務。前開會員於使用本服務時，本公司即推定會員之法定代理人、輔助人已閱讀、瞭解並同意接受本契約之約束。</p>
      </div>
      <div class="mt-4">
        <p class="font-semibold mb-2">第五條  使用服務及騎乘注意事項</p>
        <ul class="pl-6">
          <li v-for="(rule5, index) in rules5" :key="`rule5-${index}`" class="list-decimal">
            {{ rule5.title }}
            <!-- {{ rule2.content }} -->
            <ul class="pl-6">
              <li v-for="(rule, index) in rule5.contents" :key="`rule5-content-${index}`" class="list-disc">
                {{ rule }}
              </li>
            </ul>
          </li>
        </ul>
      </div>
      <div class="mt-4">
        <p class="font-semibold mb-2">第六條  扣款辦法及費率</p>
        <ul class="pl-6">
          <li v-for="(rule, index) in rules6" :key="`rule6-${index}`" class="list-decimal">{{ rule }}</li>
        </ul>
      </div>
      <div class="mt-4">
        <p class="font-semibold mb-2">第七條  服務變更、終止、暫停或中斷</p>
        <ul class="pl-6">
          <li v-for="(rule, index) in rules7" :key="`rule7-${index}`" class="list-decimal">{{ rule }}</li>
        </ul>
      </div>
      <div class="mt-4">
        <p class="font-semibold mb-2">第八條  廣告</p>
        <p class="pl-2">會員在本服務中瀏覽到的所有廣告內容、文字與圖片之說明、展示樣品或其他銷售資訊，除本公司明知或可得而知該廣告有不實之情事而仍為刊登者外，本公司不為此負擔任何賠償責任。</p>
      </div>
      <div class="mt-4">
        <p class="font-semibold mb-2">第九條  智慧財產權</p>
        <ul class="pl-6">
          <li v-for="(rule, index) in rules9" :key="`rule9-${index}`" class="list-decimal">{{ rule }}</li>
        </ul>
      </div>
      <div class="mt-4">
        <p class="font-semibold mb-2">第十條  契約效力</p>
        <ul class="pl-6">
          <li v-for="(rule, index) in rules10" :key="`rule10-${index}`" class="list-decimal">{{ rule }}</li>
        </ul>
      </div>
      <div class="mt-4">
        <p class="font-semibold mb-2">第十一條  契約增訂、修改及終止</p>
        <p class="pl-2">本契約如有增訂、修改或終止者，本公司將於本服務之網站及APP公告，並以適當方式通知之。</p>
      </div>
      <div class="mt-4">
        <p class="font-semibold mb-2">第十二條  準據法及管轄法院</p>
        <ul class="pl-6">
          <li v-for="(rule, index) in rules12" :key="`rule12-${index}`" class="list-decimal">{{ rule }}</li>
        </ul>
      </div>
      <div class="mt-4">
        <p class="font-semibold mb-2">第十三條  出租人資訊</p>
        <ul class="pl-6">
          <li v-for="(rule, index) in rules13" :key="`rule13-${index}`" class="list-decimal">{{ rule }}</li>
        </ul>
      </div>
    </div>
    <div>
      <TheCheckbox 
        label="本人已閱讀了解條款內容並同意上述條款"
        name="member-policy"
        :isRequired="true"
      />
    </div>
  </div>
</template>
<style>

</style>